PANDAS EXERCISE

In [1]:
import pandas as pd

EXERCISE 1 - List-to-Series Conversion

In [2]:
given = [2,4,5,6,9]

series = pd.Series(given)
print(series)

0    2
1    4
2    5
3    6
4    9
dtype: int64

EXERCISE 2 - List-to-Series Conversion with Custom Indexing

In [6]:
given = [2,4,5,6,9]
series = pd.Series(given,index=[1,3,5,7,9])
print(series)

1    2
3    4
5    5
7    6
9    9
dtype: int64

EXERCISE 3 - Date Series Generation

In [8]:
data_series = pd.date_range(start='05-01-2022',end='05-12-2022')
print(data_series)

DatetimeIndex(['2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06', '2022-05-07', '2022-05-08',
               '2022-05-09', '2022-05-10', '2022-05-11', '2022-05-12'],
              dtype='datetime64[ns]', freq='D')

EXERCISE 4 - Implementing a function on each and every element of a series

In [9]:
series = pd.Series([2,4,6,8,10])
print(series) # pandas series initially
print()
modified_series = series.apply(lambda x:x/2)
print(modified_series) # pandas series after function application

0     2
1     4
2     6
3     8
4    10
dtype: int64

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

EXERCISE 5 - Dictionary-to-Dataframe Conversion

In [67]:
dictionary = {'name':['Vinay', 'Kushal', 'Aman','Rahul','Ramesh'],
              'age':[22, 25, 24,28,27],
              'occ':['engineer', 'doctor', 'accountant','doctor','doctor'],
             'salary':[60000,70000,50000,60000,65000]}
df = pd.DataFrame(dictionary)
print(df)

     name  age         occ  salary
0   Vinay   22    engineer   60000
1  Kushal   25      doctor   70000
2    Aman   24  accountant   50000
3   Rahul   28      doctor   60000
4  Ramesh   27      doctor   65000

EXERCISE 6 - 2D List-to-Dataframe Conversion

In [21]:
lists = [[2,'Vishal',22],
         [1,'Kushal',25],[1,'Aman',24]]

dfx = pd.DataFrame(lists,columns=['id','name','age'])
dfx

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

EXERCISE 7 - Reading CSV to Dataframe

In [14]:
df = pd.read_csv('new_qrcode2.csv')
print(df)

        qrcode                  barcode
0       ABLATX  https://kop0.com/ABLATX
1       ABLATY  https://kop0.com/ABLATY
2       ABLATZ  https://kop0.com/ABLATZ
3       ABLAT2  https://kop0.com/ABLAT2
4       ABLAT3  https://kop0.com/ABLAT3
...        ...                      ...
145452  ABRNFC  https://kop0.com/ABRNFC
145453  ABRNFD  https://kop0.com/ABRNFD
145454  ABRNFE  https://kop0.com/ABRNFE
145455  ABRNFF  https://kop0.com/ABRNFF
145456  ABRNFG  https://kop0.com/ABRNFG

[145457 rows x 2 columns]

EXERCISE 8 - Setting Custom Index in Dataframe

In [23]:
print(dfx.head())

print()

dataframe_customindex = dfx.set_index('id')
print(dataframe_customindex.head())

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

EXERCISE 9 - Sorting a Dataframe by Index

print(dataframe_customindex)
print()
dataframe_sorted = dataframe_customindex.sort_index()
print(dataframe_sorted)

EXERCISE 10 - Sorting a Dataframe by Multiple Columns

In [31]:
print(dfx) #original dataframe

print()

df_sorted = dfx.sort_values(by=['id','age'])
df_sorted

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
2   1    Aman   24
1   1  Kushal   25
0   2  Vishal   22

EXERCISE 11 - DataFrame with Custom Index to DataFrame with Dataframe with default indexes

In [33]:
print(dataframe_customindex) # custom index

print()

dataframe = dataframe_customindex.reset_index()
dataframe # original default index

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

EXERCISE 12 - Indexing and Selecting Columns in a DataFrame

In [38]:
print(dfx) # original dataframe

print()

o = dfx['name'] # extracting the column 'name'
print(o)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

In [42]:
print(dfx) # original dataframe

print()

o = dataframe.iloc[:,1] # extracting the column 'name'
print(o)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

In [43]:
print(dfx)  # original dataframe
print()
o = dfx.loc[:,'name'] # extracting the column 'name'
print(o)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

EXERCISE 13 - Indexing and Selecting Rows in a DataFrame

Given a dataframe, select first 2 rows and output them

In [44]:
print(dataframe) # original dataframe
print()
o = dataframe.iloc[[0,1], :] # extracting the 1st 2 rows of the dataframe
o

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25

Alternative Solution

In [45]:
print(dataframe) # original dataframe
print()
o = dataframe.loc[[0,1],:] # extracting the 1st 2 rows of the dataframe
print(o)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25

EXERCISE 14 - Conditional Selection of Rows in a DataFrame

In [70]:
print(dataframe) # original dataframe
print()

# selecting people with age greater than or equal to 24
dataframe_condition = dataframe.loc[dataframe['age'] >= 24]
dataframe_condition

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
1   1  Kushal   25
2   1    Aman   24

EXERCISE 15 - Applying Aggregate Functions
Given is a dataframe showing name, occupation, salary of people. Find the average salary per occupation

In [74]:
print(df)
print()

occ_avg_age = df.groupby('occ')['salary'].mean()
occ_avg_age

     name  age         occ  salary
0   Vinay   22    engineer   60000
1  Kushal   25      doctor   70000
2    Aman   24  accountant   50000
3   Rahul   28      doctor   60000
4  Ramesh   27      doctor   65000

occ
accountant    50000.0
doctor        65000.0
engineer      60000.0
Name: salary, dtype: float64

EXERCISE 16 - Filling NaN Values in a DataFrame
Given a dataframe with NaN Values, fill the NaN values with 0

In [82]:
# print(df) # original dataframe
df2 = df.assign(price=[ float('nan'),230,400, float('nan'), float('nan')])
print(df2)

print()

dataframe_nullfill = df2.fillna(0)
print(dataframe_nullfill) # dataframe after filling NaN values with 1

     name  age         occ  salary  price
0   Vinay   22    engineer   60000    NaN
1  Kushal   25      doctor   70000  230.0
2    Aman   24  accountant   50000  400.0
3   Rahul   28      doctor   60000    NaN
4  Ramesh   27      doctor   65000    NaN

     name  age         occ  salary  price
0   Vinay   22    engineer   60000    0.0
1  Kushal   25      doctor   70000  230.0
2    Aman   24  accountant   50000  400.0
3   Rahul   28      doctor   60000    0.0
4  Ramesh   27      doctor   65000    0.0

EXERCISE 17 - Applying Functions (UDFs) on DataFrame

Given is a dataframe showing Company Names (cname) and corresponding Profits (profit). Convert the values of Profit column such that values in it greater than 0 are set to True and the rest are set to False.

In [85]:
list_c = [['Shyam & Co.',-10000],['Ramlal & Bros.',10000],
           ['Sharma Enterprises',-5000],['Verma Furnitures',15000],
           ['Rahul Stores',20000]]

company_data = pd.DataFrame(list_c,columns=['c_name','profit'])
company_data

               c_name  profit
0         Shyam & Co.  -10000
1      Ramlal & Bros.   10000
2  Sharma Enterprises   -5000
3    Verma Furnitures   15000
4        Rahul Stores   20000

In [86]:
company_data.profit = company_data.profit.apply(lambda x:x>0)
company_data

               c_name  profit
0         Shyam & Co.   False
1      Ramlal & Bros.    True
2  Sharma Enterprises   False
3    Verma Furnitures    True
4        Rahul Stores    True

EXERCISE 18 - Joining 2 DataFrames by a Common Column (key)

Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID (eid) and designation of the employee (designation). Output the Dataframe containing Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position (position).

In [88]:
emp_dict = {'eid':[1,2,3,4],
            'ename':['Sid','Ramesh','Ron','Harry'],
            'stipend':[10000,10000,5000,15000]}

emp_list = [[1,'Sid','employee'],[2,'Ramesh','employee'],
           [3,'Ron','intern'],[4,'Harry','senior_employee']]

emp_data = pd.DataFrame(emp_dict)

comp_data = pd.DataFrame(emp_list,columns=['eid','stipend','position'])

In [92]:
print(emp_data) # 1st DataFrame containing employee id (eid), employee name (ename) and stipend

print()

print(comp_data) # 2nd DataFrame containing employee id (eid) and designation of the employee (position)

print()

dataframe = pd.merge(emp_data,comp_data,how='inner', on = 'eid') # required dataframe
dataframe

   eid   ename  stipend
0    1     Sid    10000
1    2  Ramesh    10000
2    3     Ron     5000
3    4   Harry    15000

   eid stipend         position
0    1     Sid         employee
1    2  Ramesh         employee
2    3     Ron           intern
3    4   Harry  senior_employee

   eid   ename  stipend_x stipend_y         position
0    1     Sid      10000       Sid         employee
1    2  Ramesh      10000    Ramesh         employee
2    3     Ron       5000       Ron           intern
3    4   Harry      15000     Harry  senior_employee

EXERCISE 19 - Getting the Non-Null Count and Data Type for Every Column

Given a dataframe, output the non-null count and data-type for every column

In [95]:
print(dataframe)

print()
print(dataframe.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   eid        4 non-null      int64
 1   ename      4 non-null      object
 2   stipend_x  4 non-null      int64
 3   stipend_y  4 non-null      object
 4   position   4 non-null      object
dtypes: int64(2), object(3)
memory usage: 192.0+ bytes
None

EXERCISE 20 - Getting the Statistical Summary of all the Numerical Features of a DataFrame

Given a dataframe, generate the statistical summary of all the numerical features present in it

In [96]:
print(dataframe)
print()
print(dataframe.describe())

   eid   ename  stipend_x stipend_y         position
0    1     Sid      10000       Sid         employee
1    2  Ramesh      10000    Ramesh         employee
2    3     Ron       5000       Ron           intern
3    4   Harry      15000     Harry  senior_employee

            eid     stipend_x
count  4.000000      4.000000
mean   2.500000  10000.000000
std    1.290994   4082.482905
min    1.000000   5000.000000
25%    1.750000   8750.000000
50%    2.500000  10000.000000
75%    3.250000  11250.000000
max    4.000000  15000.000000